apache/nuttx/arch/arm/src/tiva/hardware/cc13x0/cc13x0_ddi0_osc.h
#define DDI0_OSC_RCOSCHFCTL_RCOSCHF_CTRIM_SHIFT       (8)       /* Bits 8-15 */
#define DDI0_OSC_RCOSCHFCTL_RCOSCHF_CTRIM_MASK        (0xff << DDI0_OSC_RCOSCHFCTL_RCOSCHF_CTRIM_SHIFT)
#  define DDI0_OSC_RCOSCHFCTL_RCOSCHF_CTRIM(n)        ((uint32_t)(n) << DDI0_OSC_RCOSCHFCTL_RCOSCHF_CTRIM_SHIFT)

/* DDI0_OSC_STAT0 */

#define DDI0_OSC_STAT0_PENDINGSCLKHFSWITCHING   (1 << 0)  /* Bit 0:  Indicates when SCLK_HF clock source
                                                           *         is ready to be switched */
#define DDI0_OSC_STAT0_ADC_DATA_SHIFT           (1)       /* Bits 1-6: adc_data */
#define DDI0_OSC_STAT0_ADC_DATA_MASK            (0x3f << DDI0_OSC_STAT0_ADC_DATA_SHIFT)
#  define DDI0_OSC_STAT0_ADC_DATA(n)            ((uint32_t)(n) << DDI0_OSC_STAT0_ADC_DATA_SHIFT)
#define DDI0_OSC_STAT0_ADC_DATA_READY           (1 << 7)  /* Bit 7:  Indicates when adc_data is ready */
#define DDI0_OSC_STAT0_ADC_THMET                (1 << 8)  /* Bit 8:  ADC_THMET */
#define DDI0_OSC_STAT0_XOSC_HF_HP_BUF_EN        (1 << 10) /* Bit 10: XOSC_HF_HP_BUF_EN */
#define DDI0_OSC_STAT0_XOSC_HF_LP_BUF_EN        (1 << 11) /* Bit 11: XOSC_HF_LP_BUF_EN */
#define DDI0_OSC_STAT0_XB_48M_CLK_EN            (1 << 13) /* Bit 13: Indicates that the 48MHz clock from
                                                           *         the DOUBLER is enabled */
#define DDI0_OSC_STAT0_XOSC_HF_EN               (1 << 15) /* Bit 15: Indicates that XOSC_HF is enabled */
#define DDI0_OSC_STAT0_SCLK_LF_LOSS             (1 << 16) /* Bit 16: Indicates sclk_lf is lost */
#define DDI0_OSC_STAT0_SCLK_HF_LOSS             (1 << 17) /* Bit 17: Indicates sclk_hf is lost */
#define DDI0_OSC_STAT0_CLK_DCDC_RDY_ACK         (1 << 18) /* Bit 18: CLK_DCDC ready acknowledge */
#define DDI0_OSC_STAT0_CLK_DCDC_RDY             (1 << 19) /* Bit 19: CLK_DCDC ready */
#define DDI0_OSC_STAT0_XOSC_LF_EN               (1 << 20) /* Bit 20: XOSC_LF enable */
#define DDI0_OSC_STAT0_RCOSC_LF_EN              (1 << 21) /* Bit 21: RCOSC_LF enable */
#define DDI0_OSC_STAT0_RCOSC_HF_EN              (1 << 22) /* Bit 22: RSOSC_HF enable */
#define DDI0_OSC_STAT0_SCLK_HF_SRC              (1 << 28) /* Bit 28: Indicates source for sclk_hf */

#  define DDI0_OSC_STAT0_SCLK_HF_SRC_RCOSC      (0)  /* High frequency RCOSC clock */

#  define DDI0_OSC_STAT0_SCLK_HF_SRC_XOSC       DDI0_OSC_STAT0_SCLK_HF_SRC /* High frequency XOSC */

#define DDI0_OSC_STAT0_SCLK_LF_SRC_SHIFT        (29)      /* Bits 29-30: Indicates source for the sclk_lf */
#define DDI0_OSC_STAT0_SCLK_LF_SRC_MASK         (3 << DDI0_OSC_STAT0_SCLK_LF_SRC_SHIFT)
#  define DDI0_OSC_STAT0_SCLK_LF_SRC(n)         ((uint32_t)(n) << DDI0_OSC_STAT0_SCLK_LF_SRC_SHIFT)
#  define DDI0_OSC_STAT0_SCLK_LF_SRC_XOSCLF     (3 << DDI0_OSC_STAT0_SCLK_LF_SRC_SHIFT) /* Low frequency XOSC */
#  define DDI0_OSC_STAT0_SCLK_LF_SRC_RCOSCLF    (2 << DDI0_OSC_STAT0_SCLK_LF_SRC_SHIFT) /* Low frequency RCOSC */
#  define DDI0_OSC_STAT0_SCLK_LF_SRC_XOSCHFDLF  (1 << DDI0_OSC_STAT0_SCLK_LF_SRC_SHIFT) /* Low frequency clock derived from
                                                                                         * High Frequency XOSC */
#  define DDI0_OSC_STAT0_SCLK_LF_SRC_RCOSCHFDLF (0 << DDI0_OSC_STAT0_SCLK_LF_SRC_SHIFT) /* Low frequency clock derived from
                                                                                         * High Frequency RCOSC */

/* DDI0_OSC_STAT1 */

#define DDI0_OSC_STAT1_CLK_DCDC_GOOD                   (1 << 0)  /* Bit 0:  CLK_DCDC_GOOD */
#define DDI0_OSC_STAT1_CLK_CHP_GOOD                    (1 << 1)  /* Bit 1:  CLK_CHP_GOOD */
#define DDI0_OSC_STAT1_ACLK_REF_GOOD                   (1 << 2)  /* Bit 2:  ACLK_REF_GOOD */
#define DDI0_OSC_STAT1_ACLK_TDC_GOOD                   (1 << 3)  /* Bit 3:  ACLK_TDC_GOOD */
#define DDI0_OSC_STAT1_ACLK_ADC_GOOD                   (1 << 4)  /* Bit 4:  ACLK_ADC_GOOD */
#define DDI0_OSC_STAT1_SCLK_LF_GOOD                    (1 << 5)  /* Bit 5:  SCLK_LF_GOOD */
#define DDI0_OSC_STAT1_SCLK_MF_GOOD                    (1 << 6)  /* Bit 6:  SCLK_MF_GOOD */
#define DDI0_OSC_STAT1_SCLK_HF_GOOD                    (1 << 7)  /* Bit 7:  SCLK_HF_GOOD */
#define DDI0_OSC_STAT1_CLK_DCDC_EN                     (1 << 8)  /* Bit 8:  CLK_DCDC_EN */
#define DDI0_OSC_STAT1_CLK_CHP_EN                      (1 << 9)  /* Bit 9:  CLK_CHP_EN */
#define DDI0_OSC_STAT1_ACLK_REF_EN                     (1 << 10) /* Bit 10: ACLK_REF_EN */
#define DDI0_OSC_STAT1_ACLK_TDC_EN                     (1 << 11) /* Bit 11: ACLK_TDC_EN */
#define DDI0_OSC_STAT1_ACLK_ADC_EN                     (1 << 12) /* Bit 12: ACLK_ADC_EN */
#define DDI0_OSC_STAT1_SCLK_MF_EN                      (1 << 13) /* Bit 13: SCLK_MF_EN */
#define DDI0_OSC_STAT1_SCLK_HF_EN                      (1 << 14) /* Bit 14: SCLK_HF_EN */
#define DDI0_OSC_STAT1_FORCE_RCOSC_HF                  (1 << 15) /* Bit 15: force_rcosc_hf */
#define DDI0_OSC_STAT1_LPM_UPDATE_AMP_SHIFT            (16)      /* Bits 16-21: OSC amplitude during LPM_UPDATE state */
#define DDI0_OSC_STAT1_LPM_UPDATE_AMP_MASK             (0x3f << DDI0_OSC_STAT1_LPM_UPDATE_AMP_SHIFT)
#  define DDI0_OSC_STAT1_LPM_UPDATE_AMP(n)             ((uint32_t)(n) << DDI0_OSC_STAT1_LPM_UPDATE_AMP_SHIFT)
#define DDI0_OSC_STAT1_HPM_UPDATE_AMP_SHIFT            (22)      /* Bits 22-27: OSC amplitude during HPM_UPDATE state */
#define DDI0_OSC_STAT1_HPM_UPDATE_AMP_MASK             (0x3f << DDI0_OSC_STAT1_HPM_UPDATE_AMP_SHIFT)
#  define DDI0_OSC_STAT1_HPM_UPDATE_AMP(n)             ((uint32_t)(n) << DDI0_OSC_STAT1_HPM_UPDATE_AMP_SHIFT)
#define DDI0_OSC_STAT1_RAMPSTATE_SHIFT                 (28)      /* Bits 28-31: AMPCOMP FSM State */
#define DDI0_OSC_STAT1_RAMPSTATE_MASK                  (15 << DDI0_OSC_STAT1_RAMPSTATE_SHIFT)
#  define DDI0_OSC_STAT1_RAMPSTATE_RESET               (0 << DDI0_OSC_STAT1_RAMPSTATE_SHIFT)  /* RESET */
#  define DDI0_OSC_STAT1_RAMPSTATE_INITIALIZATION      (1 << DDI0_OSC_STAT1_RAMPSTATE_SHIFT)  /* INITIALIZATION */
#  define DDI0_OSC_STAT1_RAMPSTATE_HPM_RAMP1           (2 << DDI0_OSC_STAT1_RAMPSTATE_SHIFT)  /* HPM_RAMP1 */
#  define DDI0_OSC_STAT1_RAMPSTATE_HPM_RAMP2           (3 << DDI0_OSC_STAT1_RAMPSTATE_SHIFT)  /* HPM_RAMP2 */
#  define DDI0_OSC_STAT1_RAMPSTATE_HPM_RAMP3           (4 << DDI0_OSC_STAT1_RAMPSTATE_SHIFT)  /* HPM_RAMP3 */
#  define DDI0_OSC_STAT1_RAMPSTATE_HPM_UPDATE          (5 << DDI0_OSC_STAT1_RAMPSTATE_SHIFT)  /* HPM_UPDATE */
#  define DDI0_OSC_STAT1_RAMPSTATE_IDAC_INCREMENT      (6 << DDI0_OSC_STAT1_RAMPSTATE_SHIFT)  /* IDAC_INCREMENT */
#  define DDI0_OSC_STAT1_RAMPSTATE_IBIAS_CAP_UPDATE    (7 << DDI0_OSC_STAT1_RAMPSTATE_SHIFT)  /* IBIAS_CAP_UPDATE */
#  define DDI0_OSC_STAT1_RAMPSTATE_IBIAS_DEC_W_MEASURE (8 << DDI0_OSC_STAT1_RAMPSTATE_SHIFT)  /* IBIAS_DECREMENT_WITH_MEASURE */
#  define DDI0_OSC_STAT1_RAMPSTATE_LPM_UPDATE          (9 << DDI0_OSC_STAT1_RAMPSTATE_SHIFT)  /* LPM_UPDATE */
#  define DDI0_OSC_STAT1_RAMPSTATE_IBIAS_INC           (10 << DDI0_OSC_STAT1_RAMPSTATE_SHIFT) /* IBIAS_INCREMENT */
#  define DDI0_OSC_STAT1_RAMPSTATE_IDAC_DEC_W_MEASURE  (11 << DDI0_OSC_STAT1_RAMPSTATE_SHIFT) /* IDAC_DECREMENT_WITH_MEASURE */
#  define DDI0_OSC_STAT1_RAMPSTATE_DUMMY_TO_INIT_1     (12 << DDI0_OSC_STAT1_RAMPSTATE_SHIFT) /* DUMMY_TO_INIT_1 */
#  define DDI0_OSC_STAT1_RAMPSTATE_FAST_START          (13 << DDI0_OSC_STAT1_RAMPSTATE_SHIFT) /* FAST_START */
#  define DDI0_OSC_STAT1_RAMPSTATE_FAST_START_SETTLE   (14 << DDI0_OSC_STAT1_RAMPSTATE_SHIFT) /* FAST_START_SETTLE */

/* DDI0_OSC_STAT2 */

#define DDI0_OSC_STAT2_XOSC_HF_RF_FREQGOOD      (1 << 0)  /* Bit 0:  Frequency of xosc_hf is within +/- 20 ppm
                                                           *         and xosc_hf is good for radio operations. */
#define DDI0_OSC_STAT2_XOSC_HF_FREQGOOD         (1 << 1)  /* Bit 1:  Frequency of xosc_hf is good to use for
                                                           *         the digital clocks */
#define DDI0_OSC_STAT2_XOSC_HF_AMPGOOD          (1 << 2)  /* Bit 2:  Amplitude of xosc_hf is within the
                                                           *         required threshold (set by DDI) */
#define DDI0_OSC_STAT2_AMPCOMP_REQ              (1 << 3)  /* Bit 3:  AMPCOMP_REQ */
#define DDI0_OSC_STAT2_RAMPSTATE_SHIFT          (12)      /* Bits 12-15: xosc_hf amplitude compensation FSM */
#define DDI0_OSC_STAT2_RAMPSTATE_MASK           (15 << DDI0_OSC_STAT2_RAMPSTATE_SHIFT)
#  define DDI0_OSC_STAT2_RAMPSTATE(n)           ((uint32_t)(n) << DDI0_OSC_STAT2_RAMPSTATE_SHIFT)
#define DDI0_OSC_STAT2_HPM_RAMP3_THMET          (1 << 23) /* Bit 23: Indication of threshold is met for hpm_ramp3 */
#define DDI0_OSC_STAT2_HPM_RAMP2_THMET          (1 << 24) /* Bit 24: Indication of threshold is met for hpm_ramp2 */
#define DDI0_OSC_STAT2_HPM_RAMP1_THMET          (1 << 25) /* Bit 25: Indication of threshold is met for hpm_ramp1 */
#define DDI0_OSC_STAT2_ADC_DCBIAS_SHIFT         (26)      /* Bits 26-31: DC Bias read by RADC during SAR mode */
#define DDI0_OSC_STAT2_ADC_DCBIAS_MASK          (0x3f << DDI0_OSC_STAT2_ADC_DCBIAS_SHIFT)
#  define DDI0_OSC_STAT2_ADC_DCBIAS(n)          ((uint32_t)(n) << DDI0_OSC_STAT2_ADC_DCBIAS_SHIFT)

#endif /* __ARCH_ARM_SRC_TIVA_HARDWARE_CC13X0_CC13X0_DDI0_OSC_H */
